#29: Update README (substitute ascii with mermaid diagrams)
